#include <stdio.h>

int main(int argc, char *argv[])
{
    int a[3][2] = {{1, 6}, {9, 12}, {61, 12}};
    int (*p)[2];    /* 行指针,[2]为列数 */

    p = a;
    printf("%d %d %d %d\n", a[1][1], p[1][1], *(*(a + 1) + 1), *(*(p + 1) + 1));
    /* 
     *  1 6
     *  9 12
     *  61 12
     *  a[1][1]:先移动一行，此时a[1]为数组名，a[1][1]为a[1]行a[1]个元素，即为12.（第a[1]行a[0]为9）
     *  p[1][1]:先移动一行，此时p[1]为数组名，p[1][1]为p[1]行p[1]个元素，即为12.（第p[1]行p[0]为9）
     *  *(*(a + 1) + 1):先将a移动一行，取*，成为数组名，再加1，取*，成为值12.
     *  *(*(p + 1) + 1):先将p移动一行，取*，成为数组名，再加1，取*，成为值12.
     */

    return 0;
}